# Exercise 4.9 Data Visualization Part-1

#This script contains following:

#1 Importing libraries & datasets;

#2 Customer dataframe wrangled and all consistency and quality checks executed;

#3 Customer dataframe merged with Instacart dataframe;

#4 Merged dataframe exported in pkl format.

# 01 Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

# 02 Importing Data Sets

In [2]:
# Defining path
path=r'C:\Users\User01\16.05.2023 Instacart Basket Analysis'

In [3]:
# Importing orders_products_aggregated.pkl
ords_prods_merge= pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_aggregated.pkl'))

In [4]:
# Impotrting new Customer dataset
df_customer=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
# checking dimensions of customer data
df_customer.shape

(206209, 10)

In [6]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [7]:
#Renamed 'Surname' to 'Last Name'
df_customer.rename(columns = {'Surnam': 'Last Name'}, inplace = True)

In [8]:
#Renamed 'n_dependants' to 'No. of Dependants'
df_customer.rename(columns = {'n_dependants': 'No. of Dependants'}, inplace = True)

In [9]:
#check output
df_customer.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,No. of Dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [10]:
# checking datatypes
df_customer.dtypes

user_id               int64
First Name           object
Last Name            object
Gender               object
STATE                object
Age                   int64
date_joined          object
No. of Dependants     int64
fam_status           object
income                int64
dtype: object

In [15]:
#Changed 'user_id' to a string
df_customer['user_id'] = df_customer['user_id'].astype('str')

In [16]:
print(df_customer['user_id'].dtypes)

object

# Column user_id is categorical data hence changed datatype as string.

In [33]:
# Changing datatypes to reduce size before merging.
df_customer['user_id'] = df_customer['user_id'].astype('str')
df_customer['No. of Dependants'] = df_customer['No. of Dependants'].astype('int8')
df_customer['Age'] = df_customer['Age'].astype('int8')
df_customer['income'] = df_customer['income'].astype('int32')

In [34]:
# checking datatypes
df_customer.dtypes

user_id              object
First Name           object
Last Name            object
Gender               object
STATE                object
Age                    int8
date_joined          object
No. of Dependants      int8
fam_status           object
income                int32
dtype: object

# Finding Missing values

In [35]:
# Finding missing values in df_customer
df_customer.isnull().sum()

user_id              0
First Name           0
Last Name            0
Gender               0
STATE                0
Age                  0
date_joined          0
No. of Dependants    0
fam_status           0
income               0
dtype: int64

In [37]:
#Changing missing values to nan
df_nan = df_customer[df_customer['First Name'].isnull() == True]

In [38]:
df_nan

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, STATE, Age, date_joined, No. of Dependants, fam_status, income]
Index: []

In [39]:
#Changed 'First Name' to a string
df_customer['First Name'] = df_customer['First Name'].astype('str')

In [40]:
print(df_customer['First Name'].dtypes)

object

# Checking for mixed type

In [41]:
for col in df_customer.columns.tolist():
  mixed_type = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customer[mixed_type]) > 0:
    print (col)

In [42]:
mixed_type

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Length: 206209, dtype: bool

# First Name no longer appears as missing value due to its conversion in string datatype.

# Finding duplicates in df_customer

In [43]:
df_customer_clean = df_customer[df_customer.duplicated()]

In [44]:
df_customer_clean.shape

(0, 10)

# There is no duplicate value in new customers data set.

In [45]:
#Check shape
ords_prods_merge.shape

(31761277, 25)

In [46]:
#Check data types
ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
Unnamed: 0                   int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
mean_price                 float64
spender_flag                object
median_days                float64
frequency_flag              object
dtype: object

In [48]:
# Changing datatypes to reduce size before merging.
ords_prods_merge['order_id'] = ords_prods_merge['order_id'].astype('str')
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')
ords_prods_merge['order_number'] = ords_prods_merge['order_number'].astype('int8')
ords_prods_merge['orders_day_of_week'] = ords_prods_merge['orders_day_of_week'].astype('int8')
ords_prods_merge['order_hour_of_day'] = ords_prods_merge['order_hour_of_day'].astype('int8')
ords_prods_merge['product_id'] = ords_prods_merge['product_id'].astype('int32')
ords_prods_merge['reordered'] = ords_prods_merge['reordered'].astype('int8')
ords_prods_merge['aisle_id'] = ords_prods_merge['aisle_id'].astype('int8')

In [52]:
# Changing datatypes to reduce size before merging.
ords_prods_merge['department_id'] = ords_prods_merge['department_id'].astype('int8')
ords_prods_merge['max_order'] = ords_prods_merge['max_order'].astype('int8')
ords_prods_merge['days_since_prior_order'] = ords_prods_merge['days_since_prior_order'].astype('float16')
ords_prods_merge['prices'] = ords_prods_merge['prices'].astype('float32')
ords_prods_merge['mean_price'] = ords_prods_merge['mean_price'].astype('float16')
ords_prods_merge['median_days'] = ords_prods_merge['median_days'].astype('float16')

In [53]:
#Check data types
ords_prods_merge.dtypes

order_id                    object
user_id                     object
order_number                  int8
orders_day_of_week            int8
order_hour_of_day             int8
days_since_prior_order     float16
product_id                   int32
add_to_cart_order            int64
reordered                     int8
Unnamed: 0                   int64
product_name                object
aisle_id                      int8
department_id                 int8
prices                     float32
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                     int8
loyalty_flag                object
mean_price                 float16
spender_flag                object
median_days                float16
frequency_flag              object
dtype: object

In [54]:
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,mean_price,spender_flag,median_days,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,195,...,Mid-range product,Regularly busy,Regularly busy day,Average orders,10,New customer,6.390625,Low Spender,20.0,Regular customer
1,2398795,1,2,3,7,15.0,196,1,1,195,...,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,6.390625,Low Spender,20.0,Regular customer
2,473747,1,3,3,12,21.0,196,1,1,195,...,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,6.390625,Low Spender,20.0,Regular customer
3,2254736,1,4,4,7,29.0,196,1,1,195,...,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,6.390625,Low Spender,20.0,Regular customer
4,431534,1,5,4,15,28.0,196,1,1,195,...,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,6.390625,Low Spender,20.0,Regular customer

# Merging order_products_aggregated data with new customer column on common key 'user_id'.

In [55]:
#Merge the data sets on the 'user_id' column
df_combined = ords_prods_merge.merge(df_customer, on = 'user_id')

In [56]:
df_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,frequency_flag,First Name,Last Name,Gender,STATE,Age,date_joined,No. of Dependants,fam_status,income
0,2539329,1,1,2,8,NaN,196,1,0,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

# Cleaning up the column headers so they're consistent. Turned uppercase column names to lower case.

In [57]:
df_combined.rename(columns = {'First Name' : 'first_name', 'Last Name' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'No. of Dependants' : 'number_of_dependants', 'fam_status' : 'marital_status'}, inplace = True)

In [58]:
#Recheck output
df_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,Unnamed: 0,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,number_of_dependants,marital_status,income
0,2539329,1,1,2,8,NaN,196,1,0,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,195,...,Regular customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [59]:
# Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.
df_combined.to_pickle(os.path.join(path, '02 Data', 'Prepared Data','customer_merged.pkl'))